In [1]:
import pandas as pd
import numpy as np

In [14]:
data=pd.read_csv("titanic.csv",index_col='PassengerId')

In [15]:
data.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [124]:
data.describe()

         Survived      Pclass         Age       SibSp       Parch        Fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [34]:
a=data["Sex"].value_counts()
print a

male      577
female    314
Name: Sex, dtype: int64

In [35]:
f1=open("f1.txt",'w')
f1.write("%d %d" %(a[0],a[1]))
f1.close()

### 2

In [39]:
surv=data['Survived'].value_counts()
print surv

0    549
1    342
Name: Survived, dtype: int64

In [82]:
survived=round((float(surv[1])/(surv[0]+surv[1]))*100,2)
f2=open("f2.txt",'w')
f2.write("%0.2f"%survived)
f2.close()

### 3

In [112]:
cl=data["Pclass"].value_counts()
print cl

3    491
1    216
2    184
Name: Pclass, dtype: int64

In [113]:
f3=open("f3.txt","w")
tmp=round((float(cl[1])/((cl[3]+cl[2]+cl[1])))*100,2)
f3.write("%0.2f"%tmp)
f3.close()

### 4

In [136]:
age=data["Age"].describe()
age

count    714.000000
mean      29.699118
std       14.526497
min        0.420000
25%       20.125000
50%       28.000000
75%       38.000000
max       80.000000
Name: Age, dtype: float64

In [138]:
f4=open("f4.txt",'w')
f4.write("%0.2f %d"%(age[1],age[5]))
f4.close()

In [134]:
print age[1],age[5]

29.6991176471 28.0

### 5

In [153]:
tmp=data.corr(method='pearson')
tmp["SibSp"]['Parch']

0.41483769862015263

In [154]:
f5=open("f5.txt","w")
f5.write("%0.2f" %(tmp["SibSp"]['Parch']))
f5.close()

### 6

In [260]:
tmp=data["Name"]

In [261]:
len(tmp)

891

In [ ]:
for i in tmp:

In [262]:
f_name=[]
for i in tmp:
    tmp=i.split(". ")
    if ('Mr'not in tmp[0]):
        tmp2=tmp[1].split(" ")
        f_name.append(tmp2[0])

In [264]:
f_name

['Laina',
 'Gosta',
 'Marguerite',
 'Elizabeth',
 'Hulda',
 'Eugene',
 'Anna',
 'Torborg',
 'Ellen',
 'Manuel',
 'Mary',
 'Augusta',
 'Jamila',
 'Simonne',
 'Margaret',
 'Bridget',
 'Juha',
 'Emily',
 'Constance',
 'William',
 'Amelie',
 'Harald',
 'Gerios',
 'Erna',
 'Lillian',
 'Alden',
 'Elizabeth',
 'Brigdet',
 'Bertha',
 'Mabel',
 'Matilda',
 'Anna',
 'Bertha',
 'Hileni',
 'Katriina',
 'Malake',
 'Ellis',
 'Susan',
 'Elias',
 'Anna',
 'Helen',
 'Anna',
 'Robina',
 'Thomas',
 'Robert',
 'Katherine',
 'Thomas',
 'Eino',
 'Frank',
 'Arthur',
 'Eleanor',
 'Henry',
 'Ann',
 'Constance',
 'Clarence',
 'Richard',
 'Luise',
 'Carla',
 'Michel',
 'Elise',
 'Margaret',
 'Henriette',
 'Telma',
 'Helen',
 'Clear',
 'Madeleine',
 'Eliina',
 'Albina',
 'Mathilde',
 'Lillian',
 'Alice',
 'Marjorie',
 'Thamine',
 'Katherine',
 'William',
 'Agda',
 'Ernest',
 'Gladys',
 'Anna',
 'Edvin',
 'Delia',
 'Amelia',
 'Hanora',
 'Kornelia',
 'Augusta',
 'Eric',
 'Kate',
 'Ellen',
 'Aloisia',
 'Helen',
 'Anna',
 'Nora',
 'Hudson',
 'Margaret',
 'Laura',
 'Margaret',
 'Emily',
 'Helmina',
 'Ernest',
 'Mary',
 'Hilda',
 'Marie',
 'Jean',
 'Agnes',
 'Elizabeth',
 'Edmond',
 'Alice',
 'Amelia',
 'Marion',
 'William',
 'Elsie',
 'Annie',
 'Mary',
 'Helen',
 'Annie',
 'Leontine',
 'Stina',
 'Aurora',
 'Rosalie',
 'Maria',
 'Sidney',
 'Kate',
 'Bertha',
 'Marjorie',
 'Elina',
 'Alfred',
 'Mari',
 'Marija',
 'William',
 'Ida',
 'Daisy',
 'Lyyli',
 'Catharina',
 'Kate',
 'Lucile',
 'Doolina',
 'Encarnacion',
 'Washington',
 'Madeleine',
 'Marie',
 'Arthur',
 'Ellen',
 'Helene',
 'Ida',
 'Hildur',
 'Harold',
 'Jeannie',
 'Eden',
 'Elizabeth',
 'Mary',
 'Bridget',
 'Kristina',
 'Roberta',
 'Anne',
 'Lucy',
 'Phyllis',
 'Marija',
 'Eva',
 'Archibald',
 'Bertha',
 'Hedwig',
 'Harriet',
 'Ingeborg',
 'Sigrid',
 'John',
 'Velin',
 '(Lucille',
 '(Marion',
 'Mary',
 'Ethel',
 'Julie',
 'Ruth',
 'Mary',
 'Jessie',
 'Cosmo',
 'Elizabeth',
 'Margaret',
 'Alice',
 'Marion',
 'Charles',
 'Gretchen',
 'Max',
 'Mabel',
 'Mary',
 'Emma',
 'Margit',
 'Eugenie',
 'Oberst',
 'Amy',
 'Elsie',
 'Hanora',
 'Hanora',
 'Henry',
 'Anna',
 'Katie',
 'Georgette',
 'Manca',
 'John',
 'Katherine',
 'Saiide',
 'Alice',
 'Halim',
 'Berthe',
 'Caroline',
 'Edwina',
 'Annie',
 'Margareth',
 'Pieta',
 'Elisabeth',
 'Susan',
 'Edward',
 'Anna',
 'Joan',
 'Meier',
 'Viljo',
 'of',
 'Arthur',
 'Mary',
 'Virginia',
 'Banoura',
 'Anna',
 'George',
 'Bertram',
 'Stella',
 'Alice',
 'William',
 'Assad',
 'Ellen',
 'Ebba',
 'Wendla',
 'Karl',
 'John',
 'Urho',
 'Andre',
 'George',
 'Sara',
 'Augusta',
 'John',
 'Sigvard',
 'Nourelain',
 'Mary',
 'Dorothy',
 'Asuncion',
 'Harold',
 'Adele',
 'Gerda',
 'Juozas',
 'Margaret',
 'Catherine']

In [236]:
d={'Name':f_name}
df=pd.DataFrame(data=d)

In [237]:
df['Name'].value_counts()

Andersson        6
Lefebre          4
Sage             4
Rice             4
Goodwin          4
Skoog            4
Palsson          3
Asplund          3
Baclini          3
Panula           3
Carter           3
Nicola-Yarred    2
Ford             2
Allison          2
Zabour           2
Crosby           2
Fortune          2
Johnson          2
Jussila          2
Minahan          2
Murphy           2
Richards         2
Newell           2
Ryerson          2
Becker           2
Coutts           2
Kelly            2
Moubarek         2
Harper           2
Navratil         2
                ..
Haas             1
Moor             1
Ohman            1
Johnston         1
Peter            1
McCoy            1
Hippach          1
Cleaver          1
Frauenthal       1
Kirkland         1
Hegarty          1
Van Impe         1
Andrews          1
Gilnagh          1
Wells            1
Sinkkonen        1
Collyer          1
LeRoy            1
Vestrom          1
Mellinger        1
Glynn            1
Bonnell          1
Devaney          1
Meanwell         1
Boulos           1
Dahlberg         1
Goldsmith        1
O'Driscoll       1
Jermyn           1
Cacic            1
Name: Name, dtype: int64

In [238]:
f6=open("f6.txt","w")
f6.write("Lefebre")
f6.close()

In [272]:
d={"Name":data["Name"],"Sex":data['Sex']}
tmp=pd.DataFrame(d)

In [274]:
tmp.head()

                                                          Name     Sex
PassengerId
1                                      Braund, Mr. Owen Harris    male
2            Cumings, Mrs. John Bradley (Florence Briggs Th...  female
3                                       Heikkinen, Miss. Laina  female
4                 Futrelle, Mrs. Jacques Heath (Lily May Peel)  female
5                                     Allen, Mr. William Henry    male

In [275]:
tmp=tmp[tmp.Sex!="male"]

In [276]:
tmp.head()

                                                          Name     Sex
PassengerId
2            Cumings, Mrs. John Bradley (Florence Briggs Th...  female
3                                       Heikkinen, Miss. Laina  female
4                 Futrelle, Mrs. Jacques Heath (Lily May Peel)  female
9            Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)  female
10                         Nasser, Mrs. Nicholas (Adele Achem)  female

In [302]:
name=[]
tmp=tmp['Name']
for i in tmp:
    tmp2=i.split(". ")
    tmp3=tmp2[1].split(' ')
    name.append(tmp3[0])

In [308]:
len(name)

314

In [304]:
d={'Name':name}
name=pd.DataFrame(d)

In [307]:
name["Name"].value_counts()

William       13
Anna           9
Mary           9
Elizabeth      6
Margaret       6
Thomas         6
John           6
Frederick      5
Alice          5
James          4
Ellen          4
Helen          4
Edward         4
Bertha         4
Katherine      3
Samuel         3
Kate           3
Annie          3
Hanora         3
Charles        3
Augusta        3
Henry          3
Joseph         3
Catherine      2
Mabel          2
Marjorie       2
Alexander      2
Marija         2
Lillian        2
Bridget        2
              ..
Agnes          1
Katie          1
Percival       1
Ingeborg       1
Lucile         1
Leopold        1
Edgar          1
(Rosa)         1
Amelie         1
Joan           1
Amy            1
Carl           1
Lyyli          1
Catharina      1
Gladys         1
Erna           1
Sigrid         1
Norman         1
(Karolina)     1
Edwy           1
Sinai          1
Gretchen       1
Edwina         1
(Beila)        1
Eliina         1
Dickinson      1
Leontine       1
Harvey         1
(Ada           1
Richard        1
Name: Name, dtype: int64

In [311]:
f6=open("f6.txt","w")
f6.write("Anna")
f6.close()